IDEA StatiCa Open Model
SubStructureLoading.LoadCases Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of LoadCases
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ReferenceElement> LoadCases { get; set; }
Public Property LoadCases As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ LoadCases {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
SubStructureLoading Class
IdeaRS.OpenModel.Model Namespace